app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `company_name`, `email`, `password`, `updated_at`, `created_at`) values ('test', 'test', 'test123@gmail.com', '$2y$10$bGP6oWdOL80GcO2nMa2LtesftSPOQXOohs3n/mdzIFYh.ddwdFLyG', '2022-06-07 09:54:51', '2022-06-07 09:54:51')
---
    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'company_name' => $data['c_name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);