app/Http/Controllers/InventoryController.php

    public function index()
    {
        $user = User::find(Auth::User()->id);
        // $products = TempProduct::where('user_id',Auth::User()->id)->get();
        // $products = $user->products;
        // $catag = $products[2]->category_id;
        // $catag = Category::find($catag);
        // dd($catag->name);
        return view('app.inventory')->with('products',$user->products);
---
select * from `users` where `users`.`id` = 2 limit 1
select * from `products` where `products`.`user_id` = 2 and `products`.`user_id` is not null