app/Http/Controllers/PurchaseController.php

select * from `users` where `users`.`id` = 2 limit 1
select * from `temp_products` where `temp_products`.`user_id` = 2 and `temp_products`.`user_id` is not null
select * from `categories` where `categories`.`user_id` = 2 and `categories`.`user_id` is not null
select * from `suppliers` where `suppliers`.`user_id` = 2 and `suppliers`.`user_id` is not null
---
    public function index(){
        $user = User::find(Auth::User()->id);
        return view('app.purchase')
            //    ->with('temp_products', $user->temp_products)
               ->with('categories'   , $user->categories)
               ->with('suppliers'    , $user->suppliers);

insert into `purchases` (`total_amount`, `discount`, `net_amount`, `balance`, `paid_amount`, `supplier_id`, `user_id`, `updated_at`, `created_at`) values ('1000', '0', '0', '0', '0', '3', 2, '2022-06-07 11:19:26', '2022-06-07 11:19:26')
select * from `users` where `users`.`id` = 2 limit 1
insert into `products` (`product_name`, `p_code`, `p_price`, `ws_price`, `s_price`, `quantity`, `category_id`, `supplier_id`, `user_id`, `purchase_id`, `updated_at`, `created_at`) values ('test catag charger', 'P52', 100, 100, 100, 10, '2', '2', 2, 9, '2022-06-07 11:19:26', '2022-06-07 11:19:26')
select * from `temp_products` where `temp_products`.`user_id` = 1 and `temp_products`.`user_id` is not null
delete from `temp_products` where `user_id` = 2
---
    public function store(Request $request)
    {


        $request['user_id'] = Auth::User()->id;
        // dd($request->all());
        $values = Purchase::Create($request->all());

        $user = User::find(Auth::user()->id);
        $products = $user->temp_products;

        foreach ($products as $product) {
            $product['purchase_id'] = $values->id;
            Product::create($product->toArray());
        }
        TempProduct::where('user_id', $user->id)->delete();