app/Http/Controllers/SupplierController.php

    public function refresh(){
        $user = User::find(Auth::user()->id);
---
select * from `users` where `users`.`id` = 2 limit 1