app/Http/Controllers/TempProductController.php

insert into `temp_products` (`p_code`, `product_name`, `p_price`, `ws_price`, `s_price`, `quantity`, `category_id`, `supplier_id`, `user_id`, `updated_at`, `created_at`) values ('P52', 'test catag charger', '100', '100', '100', '10', '2', '2', 2, '2022-06-07 11:20:57', '2022-06-07 11:20:57')
---
    public function tempCreate(Request $request){

        $request->validate([
            'product_name'  => 'required',
            'p_price'       => 'required|integer',
            'ws_price'      => 'required|integer',
            's_price'       => 'required|integer',
            'quantity'      => 'required|integer',
            'category_id'   => 'required|integer',
            'supplier_id'   => 'required|integer',
        ]);

        $tempProduct = new TempProduct;
        if($request->input('p_code') == '')
            $tempProduct->p_code = 'N/A';
        else
        $tempProduct->p_code       = $request->input('p_code');
        $tempProduct->product_name = $request->input('product_name');
        $tempProduct->p_price      = $request->input('p_price');
        $tempProduct->ws_price     = $request->input('ws_price');
        $tempProduct->s_price      = $request->input('s_price');
        $tempProduct->quantity     = $request->input('quantity');
        $tempProduct->category_id  = $request->input('category_id');
        $tempProduct->supplier_id  = $request->input('supplier_id');
        $tempProduct->user_id      = Auth::User()->id;
        $tempProduct->save();

select * from `users` where `users`.`id` = 2 limit 1
---
    public function refresh(){
        $user = User::find(Auth::user()->id);

select * from `temp_products` where `temp_products`.`id` = '5' limit 1
---
    public function tempUpdate(Request $request){
        // return response()->json([
        //     'status' => 200
        // ]);
        // $request->validate([
        //     'p_id'         => 'required',
        //     'product_name' => 'required',
        //     'p_price'      => 'required',
        //     'ws_price'     => 'required',
        //     's_price'      => 'required',
        //     'quantity'     => 'required',
        //     'category_id'     => 'required',
        // ]);
        // dd($request->all)->toArray();
        $tempProduct = TempProduct::find($request->id);